<script lang="ts" setup>
import { ref } from "vue";

const activeNames = ref(["1"]);
const activeNames2 = ref(["4"]);
</script>

<template>
  <el-tabs type="border-card" class="demo-tabs">
    <el-tab-pane>
      <template #label>
        <span class="custom-tabs-label">
          <span>三大岩经典图集</span>
        </span>
      </template>
      <!-- 轮播图 -->
      <div class="block text-center">
        <el-carousel height="600px" width="80%" motion-blur>
          <el-carousel-item>
            <img
              src="@/assets/RockIdenti/Dan Bristy.jpg"
              style="width: 100%; margin: 0 auto"
            /> </el-carousel-item
          ><el-carousel-item>
            <img
              src="@/assets/RockIdenti/希腊岩洞.jpg"
              style="width: 100%; margin: 0 auto"
            />
          </el-carousel-item>
          <el-carousel-item>
            <img
              src="@/assets/RockIdenti/Rock Kicker.jpg"
              style="width: 100%; margin: 0 auto"
            />
          </el-carousel-item>
        </el-carousel>
      </div>
      <p class="demonstration-center">
        岩石是天然产出的，由矿物或类似矿物的物质(如有机质、玻璃、非晶质等)组成的固态集合体。它是组成地壳的物质之一，是构成地球岩石圈的主要成分。
      </p>
      <p class="demonstration-center">
        岩石按成因可分为火成岩、沉积岩和变质岩三大类。先存岩石可以在高温等条件下发生熔融形成岩浆，岩浆冷凝固结形成火成岩。先存的火成岩、沉积岩和变质岩暴露于地表后经过风化、剥蚀、搬运和沉积可以形成沉积岩。或者在不同的温度、压力等外界作用下发生化学成分、矿物成分、结构构造等的改变，形成与原先岩石特征不同的变质岩。这些岩石相互转化的过程被称为——岩石循环。
      </p>

      <div class="demo-collapse">
        <el-collapse v-model="activeNames" accordion>
          <el-collapse-item title="01岩浆岩" name="1">
            <p>
              火成岩又称岩浆岩，是在岩石循环过程中产生的三大岩类的一种，是指岩浆冷却后（地壳里喷出的岩浆，或者被融化的现存岩石），成形的一种岩石。
            </p>
            <p>
              目前，已经发现的岩浆岩有700多种，大部分是在地壳里面的岩石。一般来说，岩浆岩易出现于板块交界地带的火山区。
            </p>
            <p>
              火成岩可以分为两种基本类型。第一种为侵入岩（Intrusive
              rocks），是指当上覆岩层压力减轻时，软流层中的岩浆就钻出，在地壳深处冷凝而形成的岩石。例如闪长岩、辉长岩、花岗岩、伟晶岩和橄榄岩等。闪长岩为典型的中性岩，整体呈暗灰色。其中主要成分为白色的斜长石和深色的角闪石，还含有少量的辉石、黑云母和石英等。
            </p>
            <p>
              闪长岩为典型的中性岩，整体呈暗灰色。其中主要成分为白色的斜长石和深色的角闪石，还含有少量的辉石、黑云母和石英等。
            </p>
            <p>
              辉长岩为来源于深部地壳或上地幔的玄武质岩浆经侵入作用形成，主要矿物成分为基性斜长石和单斜辉石，广泛分布于地壳的各种构造环境和月球上。
            </p>
            <p>
              伟晶岩是由巨粒矿物组成的淡色结晶岩，是富含挥发分的硅酸盐残浆，侵入到火成岩或围岩裂隙中缓慢结晶而成的。
            </p>
            <p>
              第二种为喷出岩（Extrusive
              rocks），是指岩浆喷出地表冷凝而形成的火成岩。这种岩石包括安山岩、玄武岩、英安岩、黑曜岩和流纹岩等。
            </p>
            <p>
              玄武岩是一种细粒致密、外观呈黑色的火成岩，由基性岩浆喷发凝结而成，主要成分是硅铝酸钠或硅铝酸钙。玄武岩岩浆的黏度小，易于流动，常形成广大的熔岩台地，所以分布很广。
            </p>
            <p>
              安山岩为中性喷出岩，分布范围仅次于玄武岩。岩石一般为灰、灰绿、淡紫或紫红色，其中含有少量斜长石、角闪石、辉石和黑云母的斑晶，且斑晶常呈定向排列，这是由于岩浆是在流动中冷却的。
            </p>
            <p>
              黑曜岩（黑曜石）是一种致密块状或熔渣状的酸性玻璃质火山岩，和松脂岩、珍珠岩都统称为酸性火山玻璃岩。呈致密块状，有时见石泡构造。
            </p>
            <p>
              流纹岩的化学成分与花岗岩相同，是一种火山喷出岩。大多数流纹岩都具斑状结构，表明结晶作用在喷发作用以前就已开始。
            </p>
          </el-collapse-item>
          <el-collapse-item title="02沉积岩" name="2">
            <p>
              沉积岩是在岩石循环过程中产生的，三种组成地球岩石圈的主要岩石之一。沉积岩是在地壳发展演化过程中，在地表或接近地表的常温常压条件下，任何先成岩遭受风化剥蚀作用的破坏产物，以及生物作用与火山作用的产物，在原地或经过外力的搬运，所形成的沉积层，又经成岩作用而成的岩石。
            </p>
            <p>沉积岩根据其形成特征，可分为三种基本类型。</p>
            <p>
              第一种为碎屑沉积岩（Clastic sedimentary
              rocks），它们的形成主要与外动力地质因素有关，大多为机械破碎的产物经搬运沉积而成。如角砾岩、砾岩、砂岩和粉砂岩等。
            </p>
            <p>
              角砾岩是由从母岩上破碎下来的，颗粒直径大于2毫米的碎屑，经过搬运、沉积、压实、胶结而形成的岩石。组成角砾岩的碎屑物质，一般因原地堆积或搬运距离很短，因此磨圆度极低，分选很差，形状各异，棱角分明。角砾岩能很好反映母岩成分和性质，它与母岩关系较砾岩更为密切。角砾岩最常见的形成位置之一是露头的底部，物理风化碎屑堆积处。另一种是在离露头不远的河流沉积物或冲积扇上。
            </p>
            <p>
              砾岩是一种由从母岩上破碎下来的，颗粒直径大于2毫米的碎屑，经过搬运、沉积、压实、胶结而形成的岩石。砾岩比较粗糙，可以见到明显的砾石，如果胶结成岩石的砾石具有棱角，则称为角砾岩。
            </p>
            <p>
              砂岩主要由各种砂粒胶结而成的，颗粒直径在0.05-2mm，其中砂粒含量要大于50%，结构稳定，通常呈淡褐色或红色，主要含硅、钙、黏土和氧化铁。
            </p>
            <p>
              粉砂岩由粒径为0.0625～0.0039毫米的粉砂的含量占50%以粉砂岩标本的一种碎屑沉积岩。粉砂岩的颜色多种多样，随混入物的成分不同而变。粉砂岩是在经过了长距离搬运、水动力条件比较安静、沉积速度缓慢的环境下形成的。
            </p>
            <p>
              第二种为化学沉积岩（Chemical sedimentary
              rocks）。是指由母岩风化产物中的溶解物质通过化学作用沉积而成的岩石。
            </p>
            <p>
              地球上最重要的铁矿床是在沉积岩中发现的。它们是经过在海洋和淡水中铁和氧结合的化学反应形成的。
            </p>
            <p>
              地球上几乎所有的主要铁矿床都在18亿年前形成的岩石中。当时地球上的海洋含有大量的溶解铁，几乎没有溶解氧。
            </p>
            <p>
              当第一个有光合作用能力的生物开始向水中释放氧气时，氧气立即与大量溶解的铁结合，产生赤铁矿或磁铁矿，铁矿床逐渐开始形成。这些矿物大量地沉积在海底，形成了现在所说的条带状含铁建造(Banded
              iron formation)。
            </p>
            <p>
              最后一种为生物沉积岩（Organic sedimentary
              rocks）。生物沉积岩是由生物体的堆积造成的，如花粉、孢子、贝壳、珊瑚等大量堆积，经过成岩作用形成。
            </p>
            <p>
              例如部分生物成因的石灰岩（limestone）：白垩岩（Chalk）、贝壳灰岩（Coquina）等。
            </p>
            <p>
              白垩岩是一种软质、白色、多孔的沉积碳酸盐岩，是一种由方解石组成的石灰岩。它是在相当深的海洋条件下，由一种叫做颗石藻的微生物脱落下来的细小方解石壳逐渐堆积而成的。
            </p>
            <p>贝壳灰岩是一种由完整的生物贝壳被泥晶方解石固结而成的石灰岩。</p>
            <p>
              按生物种类不同可分为腕足类贝壳灰岩、软体类贝壳灰岩等。也可直接按生物种类命名，如有孔虫灰岩、纺锤虫灰岩等。
            </p>
          </el-collapse-item>
          <el-collapse-item title="03变质岩" name="3">
            <p>变质岩是通过变质作用形成的三大岩之一。</p>
            <p>
              变质作用是指岩石在基本上处于固体状态下，受到温度、压力及化学活动性流体的作用，发生矿物成分、化学成分、岩石结构与构造变化的地质作用。
            </p>
            <p>
              变质岩的岩性特征，既受原岩的控制，具有一定继承性，又因经受了不同的变质作用，在矿物成分和结构构造上又具有新生性（如含有变质矿物和定向构造等），因此变质岩具有众多种类。
            </p>
            <p>
              如片麻岩，
              是由岩浆岩或沉积岩经深变质作用而成的岩石。具有暗色与浅色矿物相间呈定向或条带状断续排列的片麻状构造特征，呈变晶结构。片麻岩按原岩的不同，可分为由岩浆岩变质而成的“正片麻岩”和由沉积岩变质而成的“副片麻岩”。
            </p>
            <p>
              千枚岩是具有千枚状构造的低级变质岩石。原岩通常为泥质岩石（或含硅质、钙质、炭质的泥质岩）、粉砂岩及中、酸性凝灰岩等。
            </p>
            <p>
              片岩是具有典型的片状构造的变质岩一种，是区域变质的产物。片状，板状，纤维状矿物相互平行排列，粒度较粗，肉眼可辨别。主要矿物为云母，石英，角闪石，绿泥石等。
            </p>
            <p>
              板岩是具有板状构造，基本没有重结晶的变质岩。原岩为泥质、粉质或中性凝灰岩，沿板理方向可以剥成薄片。
            </p>
            <p>
              大理岩是由碳酸盐岩经区域变质作用或接触变质作用形成的变质岩。主要由方解石和白云石组成，具粒状变晶结构，块状（有时为条带状）构造。
            </p>
            <p>
              石英岩是一种主要由石英组成的变质岩，多由石英砂岩或其他硅质岩石经变质作用，重结晶形成。石英岩一般为块状构造，粒状变晶结构，呈晶质集合体。
            </p>
            <p>
              复杂又神奇的岩石循环在地球上重复进行着，形成了千奇百怪、各具特色的岩石，构成了地球上最具魅力的风景！
            </p></el-collapse-item
          >
        </el-collapse>
      </div>
    </el-tab-pane>
    <el-tab-pane>
      <template #label>
        <span class="custom-tabs-label">
          <span>三大岩识别</span>
        </span>
      </template>
      <!-- 轮播图 -->
      <div class="block text-center">
        <el-carousel height="600px" width="80%" motion-blur>
          <el-carousel-item>
            <img
              src="@/assets/RockIdenti/Dan Bristy.jpg"
              style="width: 100%; margin: 0 auto"
            /> </el-carousel-item
          ><el-carousel-item>
            <img
              src="@/assets/RockIdenti/希腊岩洞.jpg"
              style="width: 100%; margin: 0 auto"
            />
          </el-carousel-item>
          <el-carousel-item>
            <img
              src="@/assets/RockIdenti/Rock Kicker.jpg"
              style="width: 100%; margin: 0 auto"
            />
          </el-carousel-item>
        </el-carousel>
      </div>

      <div class="demo-collapse">
        <el-collapse v-model="activeNames2" accordion>
          <el-collapse-item title="01岩浆岩" name="4">
            <div>l．颜色</div>
            <div>
              <p>
                岩浆岩的颜色大致可分为浅色、中色和暗色几种。观察时，应分出原生色「即新鲜面的颜色」及次生色「即经过次生变化后风化面的颜色」。原生色可反映岩石的成分及形成环境，次生色可反映岩石的经历过程。
              </p>
              <p>深成岩的颜色深浅，是暗色矿物含量和浅色矿物含量比率的反映。</p>
              <p>
                辉长岩、撖榄岩为深色；闪长岩为中色；花岗岩、霞石正长岩为浅色。
              </p>
              <p>
                浅成岩的颜色深浅，多受矿物拉度大小。结晶程度的影响，如微晶和隐晶质岩石比相同成分的深成岩颜色深。
              </p>
              <p>
                喷出岩的颜色深浅，则受到岩石成分、次生变化、结晶程度等方面的影响。此外，还受到强烈氧化燃烧作用的影响。通常玄武岩类多呈黑、黑绿色、蚀变后呈中绿～浅绿色；安山岩类呈深灰、暗紫～紫红色；流纹岩类呈浅灰～粉红色。
              </p>
            </div>
            <div>2．结构</div>
            <div>
              <p>
                显晶质岩石，其主要造岩矿物粒度大致相等时，应写出粒度与习惯用结构名称。如中粒辉长结构、粗粒花岗结构、中粒二长结、粗粒半自形结构等；
              </p>
              <p>
                隐晶质至玻璃质岩石，应写明隐晶质结构或半晶质结构，或玻璃质结构。
              </p>
              <p>
                具隐晶质至玻璃质的岩石，以及其它显微结构的岩石，只有在岩石薄片鉴定的情沉下，才能定出其具体结构。
              </p>
            </div>
            <div>3．构造</div>
            <div>
              <p>
                最常见的岩浆岩构造的种类不多，只须准确描述即可。侵入岩多具块状、斑杂状、条带状构造；喷出岩则多具气孔、杏仁、流纹构造等。
              </p>
            </div>
            <div>4．矿物成分</div>
            <div>
              <p>
                对矿物成分的观察和描述应包括以下内容：矿物名称、物性特点、粒度大小、百分含量等。
              </p>
              <p>
                对显晶质等粒结构的岩石，应描述主要矿物、次要矿物、副矿物、次生矿物。描述时应按含量多的先描述，含量少的后描，即“先多后少”的顺序。
              </p>
              <p>
                对矿物特征的描述应包括以下几方面：颜色、形态及鉴定特征（包括可反映岩石的结构、构造等特征）、粒度、目估百分含量等。
              </p>
              <p>
                岩石具斑状或似斑状结构时，应首先指明斑晶矿物在整个岩石中的目估百分含量，然后以斑晶矿物含量“先多后少”的顺序描述其特征。接着描述基质中矿物的特征，如矿物粒度呈细粒时，其描述顺序与要求同前述。
              </p>
              <p>
                玢岩和斑岩的区别：由基性斜长石和暗色矿物作斑晶的岩石称为：××玢岩；以钾长石和石英作斑晶的岩石称为：××斑岩。
              </p>
            </div>
            <div>5.岩浆岩描述实例</div>
            <div>
              <!-- 深成岩——橄揽辉长岩 -->
              <div>(1)深成岩——橄揽辉长岩</div>
              <div>
                <p>
                  <strong>肉眼描述：</strong
                  >新鲜面暗灰色，风化面暗褐色。中粒辉长结构，颗粒均匀，颗粒直径在2－5mm。块状构造。岩石比较新鲜。暗色矿物主要为黑色的辉石，呈近于短轴状的颗粒，有时可见解理。其次，可见少量黄绿色（或暗绿），油脂光泽的橄榄石和具珍珠光泽的黑云母。暗色矿物含量约50％。浅色矿物为斜长石，呈长板状，白色至灰色，玻璃光泽，含量约50％。
                </p>
                <p>
                  <strong>镜下描述：</strong
                  >岩石新鲜，未经蚀交。主耍矿物为普通辉石、基性斜长石，次要矿物为橄榄石、黑云母。辉长结构。
                </p>
                <p><strong>岩石定名：</strong>橄榄辉长岩</p>
              </div>
              <!-- 浅成岩——闪长玢岩 -->
              <div>(2)浅成岩——闪长玢岩</div>
              <div>
                <p>
                  <strong>肉眼描述：</strong
                  >浅灰色，斑状结构，块状构造。斑晶成分为灰白色板状斜长石和绿色柱状角闪石，斑晶直径1－6mm，斑晶占岩石体积30％左右。基质为隐晶质结构。
                </p>
                <p>
                  <strong>镜下描述：</strong
                  >斑状结构。斑晶由斜长石和角闪石组成，并有少量黑云母和石英。基质呈显微粒状结构，主要成分为斜长石，其次是角闪石，基质约占岩石体积的65%。
                </p>
                <p><strong>岩石定名：</strong>闪长玢岩</p>
              </div>
              <!-- 喷出岩——流纹岩 -->
              <div>(3)喷出岩——流纹岩</div>
              <div>
                <p>
                  <strong>肉眼描述：</strong
                  >浅紫色，斑状结构，流纹构造，气孔构造，斑晶成分为石英和透长石。石英为不规则粒状，无色，油脂光泽，贝壳状断口。透长石为柱状，无色透明，玻璃光泽，有解理。基质为隐晶质，浅紫色为主，夹杂有粉红和白色，稍有拉长的气孔和柱状透长石组成的定向排列，斑晶直径1－2
                  mm，约占岩石体积15%。
                </p>
                <p>
                  <strong>镜下描述：</strong
                  >斑状结构，流纹构造，斑晶成分为透长石和石英。基质具霏细结构，局部玻璃质结构，略带黑色不透明微粒，占75%。
                </p>
                <p><strong>岩石定名：</strong>流纹岩</p>
              </div>
            </div>
            <div>6.岩浆岩类的野外鉴定特征</div>
            <div>
              <div>(1)橄榄岩-苦橄岩类</div>
              <div>
                <p>手标本特征：</p>
                <p>
                  <strong>纯橄榄岩：</strong
                  >几乎全由橄榄石组成。橄榄石为浅绿色，粒状，玻璃光泽，没有解理。
                </p>
                <p><strong>橄榄岩：</strong>主要由橄榄石组成，其次为辉石。</p>
                <p><strong>辉石岩：</strong>几乎全由辉石组成。</p>
                <p>
                  <strong>蛇纹石化橄榄岩：</strong
                  >网格状构造，有粒状橄榄石的残核。蛇纹石为橄榄岩蚀变产物。
                </p>
                <p>
                  <strong>苦橄岩：</strong
                  >以橄榄石为主，可出现少量的角闪石、黑云母等。成分相当于橄榄岩。
                </p>
                <p>镜下特征：</p>
                <p><strong>纯橄榄岩：</strong>橄榄石呈白形粒状或他形粒状。</p>
                <p><strong>辉石岩：</strong>斜方辉石和单斜辉石均有。</p>
                <p>
                  <strong>蛇纹石化橄榄岩：</strong
                  >蛇纹石化从岩石裂隙或橄榄石粒间开始，蚀变不彻底，仍残留有小颗粒橄榄石（残留结构），蛇纹石化过程中析出铁质，生成磁铁矿小微粒，呈不规则地分布在蛇纹石中。
                </p>
              </div>
              <div>(2)辉长岩一玄武岩类</div>
              <div>
                <p>鉴定特征：</p>
                <p>
                  <strong>辉长岩：</strong
                  >主要矿物由基佳斜长石和单斜辉石（透辉石、普通辉石、异剥辉石）组成。次要矿物有橄榄石、斜方辉石，有时有角闪石和黑云母，甚至钾长石和石英。副矿物有磁铁矿、钛铁矿、磷灰石。暗色矿物和浅色矿物含量近于1：1，色率为35－65。岩石颜色深，常呈黑色、灰色等。辉长结构，块状构造，有时呈条带状构造。辉长岩可形成独立的岩体，也可与橄榄岩构成杂岩体。
                  主要由辉石和基性科长石组成，粗一中粒辉长结构。
                </p>
                <p><strong>斜长岩：</strong>几乎全由斜长石组成。</p>
                <p>
                  <strong>辉绿岩：</strong
                  >为浅成侵人岩。矿物成分与辉长岩相似，即主要由基性斜长石和单斜辉石组成。未经蚀变的辉绿岩，颜色多为深灰或黑色，风化后呈浅绿或绿灰色。具辉绿结构（即白色的细长条斜长石搭成三角架，其间充填粒状的辉石）。辉绿岩易于蚀变，其蚀变情况大致与辉长岩相同。具有斑状结构的辉绿岩，称为辉绿玢岩。斑晶为基性斜长石和暗色矿物。
                </p>
                <p>
                  <strong>辉绿玢岩：</strong
                  >具斑状结构的辉绿岩，斑晶为斜长石和暗色矿物。
                </p>
                <p>
                  <strong>细晶辉长岩：</strong
                  >成分与辉长岩相同，只是具细粒结构而不具其它结构为特征。
                </p>
                <p>
                  <strong>橄榄玄武岩：</strong
                  >能见到橄榄石斑晶，常见橄榄石的蚀变产物——伊丁石。基质为隐晶质。
                </p>
                <p>
                  <strong>玄武岩：</strong
                  >肉眼观察为隐晶质，颜色多为黑色，黑绿色，有时为暗紫色。粗玄结构或间隐结构。有时具斑状结构。块状构造、气孔状构造。后层玄武岩中常见柱状节理。矿物成分以辉石和基性斜长石为主，这是与安山岩的主要区别。
                </p>
                <p>
                  <strong>杏仁状玄武岩：</strong>气孔中充填有白色的沸石等矿物。
                </p>
              </div>
              <div>(3)闪长岩一安山岩类</div>
              <div>
                <p>
                  此类岩石常见有闪长岩、石英闪长岩、闪长玢岩、细晶闪长岩、安山岩、英安岩。
                </p>
                <p>鉴定特征：</p>
                <p>
                  <strong>闪长岩：</strong
                  >主要由中性斜长石和角闪石（或黑云母）组成，斜长石含量大于角闪石含量，并含有少量的黑云母、辉石、正长石和石英（＜5%）。暗色矿物含量为1／3
                  左右。颜色浅灰至灰绿色。自形或半自形粒状结构，有时具似斑状结构。
                </p>
                <p>
                  <strong>石英闪长岩：</strong
                  >闪长岩中含有5％－20％的石英，称石英闪长岩。组成石英闪长岩的矿物仍以中性斜长石和角闪石为主。暗色矿物含量在15％左右。除角闪石外，还有黑云母、辉石。颜色浅灰，半自形粒状结构，块状构造。
                </p>
                <p>
                  <strong>闪长玢岩：</strong
                  >矿物成分与闪长岩相同，为闪长岩体边部产物或浅成侵人岩石。暗灰至暗绿色。斑状结构，斑晶为中性斜长石和角闪石或黑云母，基质为细粒或隐晶质物质。
                </p>
                <p>
                  <strong>细晶闪长岩：</strong>成分与闪长玢岩相同，具细晶结构。
                </p>
                <p>
                  <strong>安山岩：</strong
                  >主要由中性斜长石和角闪石组成。肉眼观察呈浅灰、深灰、红褐，以至黑色。蚀变后色调变成绿色。常具斑状结构，斑晶为宽板状中长石（斜长石）、辉石、角闪石、黑云母等，基质为隐晶质或玻基交织结构。斜长石有环带结构，角闪石和黑云母有暗化边现象，块状或气孔构造等。注意角闪石、黑云母斑晶具暗化边，基质为安山结构或交织结构。
                </p>
              </div>
              <div>(4)正长岩一粗面岩类</div>
              <div>
                <p>主要岩石类型为正长岩、二长岩、正长斑岩、粗面岩。</p>
                <p>手标本特征：</p>
                <p>
                  <strong>正长岩：</strong
                  >肉红色或浅土黄色的板状正长石为主，还有少量的斜长石和黑云母。
                </p>
                <p><strong>二长岩：</strong>由钾长石、斜长石大致各半组成。</p>
                <p><strong>正长斑岩：</strong>斑状结构，成分与正长岩相同。</p>
                <p>
                  <strong>粗面岩：</strong
                  >断口粗糙，斑状结构。透长石和斜长石组成斑晶，基质为隐晶质。
                </p>
                <p>镜下特征：</p>
                <p><strong>正长岩：</strong>以正长石为主，暗色矿物为黑云母。</p>
                <p>
                  <strong>粗面岩：</strong
                  >斑状结构，斑晶以透长石为主，并有少量黑云母、斜长石，基质为粗面结构（即大量碱性长石的柱状晶体成大致平行排列）或正斑结构（即石英或玻璃质基质中发了有许多正方形和长方形碱性长石微晶，是粗面岩、正长斑岩等斑状岩石中基质的结构）。
                </p>
              </div>
              <div>（5）花岗闪长岩一流纹英安岩类和花岗岩一流纹岩类</div>
              <div>
                <p>
                  此类岩石的主要类型有花岗岩、花岗闪长岩、花岗斑岩、花岗闪长斑岩、流纹英安岩、流纹岩、松脂岩、珍珠岩、黑曜岩。
                </p>
                <p>鉴定特征：</p>
                <p>
                  <strong>花岗闪长岩：</strong
                  >为花岗岩向闪长岩的过渡岩石，主要矿物有石英，约占20％。酸性或中性斜长石占全部长石的65％－90%，碱性长石占全部长石的35％以下，即斜长石与钾长石之比为2∶1。暗色矿物约15%，以角闪石为主，还有黑云母和辉石。副矿物有榍石、磷灰石、磁铁矿、锆石、褐帘石、独居石等。含斜长石和暗色矿物比花岗岩多一些，因而颜色稍深，呈灰绿色或暗灰色。
                </p>
                <p>
                  <strong>花岗斑岩：</strong
                  >是成分相当于花岗岩的浅成岩。全晶质、斑状结构。斑晶主要是碱性长石和石英，有时也有黑云母、角闪石等。基质成分与斑晶相同，隐晶至微晶结构。致密块状。
                </p>
                <p>
                  <strong>花岗闪长斑岩：</strong
                  >是矿物成分相当于花岗闪长岩的浅成岩。全晶质、斑状结构。斑晶以斜长石为主，但有少量的铁镁矿物、钾长石和石英作斑晶。基质为细粒石英、斜长石和碱性长石。
                </p>
                <p>
                  <strong>花岗岩：</strong
                  >中一细粒花岗结构，块状构造。石英占30％左右，长石占60％左右，暗色矿物（黑云母）＜10％。钾长石＞斜长石。
                </p>
                <p><strong>流纹岩：</strong>具流纹构造。</p>
                <p>
                  <strong>流纹斑岩：</strong
                  >具有长石和石英斑晶的流纹岩，斑晶含量＞30％。
                </p>
                <p>
                  <strong>石英斑岩：</strong
                  >以石英为斑晶的流纹岩。但也有浅成的石英斑岩。
                </p>
                <p>
                  <strong>流纹英安岩：</strong
                  >成分与花岗闪长岩相同，斑晶为斜长石、角闪石、黑云母，可有少量石英和钾长石，基质为隐晶质或玻璃质。
                </p>
                <p>
                  <strong>黑曜岩：</strong
                  >黑色，灰黑色玻璃岩石。玻璃光泽，贝壳状断口，有时含少量透长石斑晶。
                </p>
                <p>
                  <strong>珍珠岩：</strong
                  >具珍珠裂缝的玻璃质岩石（珍珠构造），有时含有各色的珍珠球。
                </p>
                <p><strong>松脂岩：</strong>树脂光泽或油脂光泽。</p>
              </div>
              <div>（6）霞石正长岩一响岩类</div>
              <div>
                <p>
                  此类岩石的主要类型有霞石正长岩、霞石正长斑岩、白榴石响岩。
                </p>
                <p>手标本特征：</p>
                <p>
                  <strong>霞石正长岩：</strong
                  >由长板状的正长石组成，次为霞石（深肉红色，粒状，油脂光泽，没有解理）和碱性暗色矿物（碱性辉石和碱性角闪石）。
                </p>
                <p>
                  <strong>霞石正长斑岩：</strong
                  >成分与霞石正长岩相同。正长石和霞石为斑晶。
                </p>
                <p>
                  <strong>响岩：</strong
                  >白榴石、透长石为斑晶，基质与斑晶成分相同，微晶结构。白榴石不稳定，可被正长石、霞石、方沸石代替，此种岩石称为假白榴石响岩。
                </p>
              </div>
              <div>(7)煌斑岩类、伟晶岩类和细晶岩类</div>
              <div>
                <p>
                  此类岩石的主要类型有云煌岩、金伯利岩、花岗细晶岩，花岗伟晶岩、闪斜煌斑岩。
                </p>
                <p>鉴定特征：</p>
                <p>
                  <strong>云煌岩：</strong
                  >主要成分为黑云母，其次为正长石。黑云母多呈褐色，略带红色，有时为绿色，假六方片状、自形晶。有些云煌岩含金云母。碱性长石晶形完整，但易于分解而变得浑浊。斑状结构，斑晶多为黑云母，基质主要由钾长石、黑云母组成。云煌岩多分布在花岗岩、花岗闪长岩和正长岩体内部。
                  闪正煌岩：由富钾碱性长石、普通角闪石和普通辉石组成，并含少量斜长石、黑云母、石英、磷灰石、磁铁矿等。斑状结构。
                </p>
                <p>
                  <strong>云斜煌岩：</strong
                  >由斜长石、黑云母、普通辉石组成。有时呈斑状结构。
                </p>
                <p>
                  <strong>闪斜煌岩：</strong
                  >由普通角闪石和斜长石组成，角闪石呈斑晶，基质亦为粒状自形晶。含量在40％以上，此外可含有透辉石、橄揽石（假像）、黑云母、正长石、石英、磷灰石。
                </p>
                <p>
                  <strong>金伯利岩：</strong
                  >主要由橄榄石、铬透辉石、金云母组成，具角砾构造。
                </p>
                <p>
                  <strong>花岗细晶岩：</strong
                  >细晶结构，主要由石英、钾长石、斜长石组成、花岗伟晶岩：伟晶结构，晶体颗粒粗大，有时呈文象结构。
                </p>
                <p>
                  <strong>闪斜煌斑岩：</strong
                  >主要矿物为角闪石．其次为斜长石：斑状结构；斑晶为角闪石．基质由斜长石及角闪石组成。
                </p>
                <p>镜下特征：</p>
                <p>
                  <strong>云煌岩：</strong
                  >黑云母自形程度好，有时可见斜长石的环带。
                </p>
                <p><strong>闪斜煌斑岩：</strong>角闪石的自形程度很好。</p>
                <p>
                  <strong>金伯利岩：</strong
                  >角砾状构造，斑状结构，角砾多为早期熔岩，斑晶为橄榄石，但已蛇纹石化，熔蚀后成圆粒状。岩石碳酸盐化、金云母化、蛇纹石化、绿泥石化强烈。
                </p>
              </div>
            </div>
          </el-collapse-item>
          <el-collapse-item title="02沉积岩" name="5">
            <div>1.砾岩、角砾岩、砂岩</div>
            <div>
              <p>
                常见岩石类型有砾岩、角砾岩、石英砂岩、长石砂岩、岩屑杂砂岩、铁质砂岩、海绿石砂岩、细粒砂岩、中粒砂岩、粗粒砂岩。
              </p>
              <div>（1）鉴定方法和步骤</div>
              <div>
                <div>
                  <div>鉴别确定岩石中的碎屑成分并估计其含量。</div>
                  <p>
                    实际测量（薄片中）和估测（手标本上）碎屑颗粒的粒径（最大、最小和一般的）。（也可利用粒度管或粒度盘以及较标准的标本进行对比）。并确定岩石的分选程度。
                  </p>
                  <div>鉴别碎屑颗粒的磨圆度。</div>
                  <div>鉴别填隙物的成分。</div>
                  <p>
                    <strong>硅质胶结物：</strong
                    >白色、致密状、硬度大于小刀、加HCl不起泡。
                  </p>
                  <p><strong>铁质胶结物：</strong>岩石往往呈紫红色。</p>
                  <p>
                    <strong>碳酸盐质胶结物：</strong>浅灰一浅绿色、加HCl起泡。
                  </p>
                  <p>
                    <strong>海绿石胶结物：</strong
                    >暗绿色，风化后使岩石带绿色斑痕。
                  </p>
                  <p>
                    <strong>泥质杂基：</strong
                    >灰色、褐色、硬度小、岩石易破碎松散、加HCl不起泡。
                  </p>
                </div>
              </div>
              <div>（2）描述实例</div>
              <div>
                <div>I.砾岩</div>
                <p>
                  灰色、砾状结构、胶结紧密、标本呈块状构造。其中砾石占70%，填隙物占30%。砾石大小不一，粒径一般在2-20mm，以2－10mm
                  为主。砾石呈圆状及次圆状，少数次棱角状，断面多呈椭圆及长条形。砾石以石灰岩和白云岩为主，还有少量喷出岩和硅质岩。填隙物浅灰绿色，多为与砾石成分相同的砂及粉砂、砂及粉砂间有钙质、泥质等填隙物。属基底式胶结类型。
                </p>
                <div>紫褐色中粒铁质砂岩</div>
                <p>
                  暗紫褐色、颜色分布不均匀。中粒砂状结构，标本呈块状构造。碎屑含量占整个岩石85%左右，胶结物约占15%。砂粒几乎都是石英，粒径0.15-1
                  mm
                  左右，分选性好，大小比较一致。胶结物主要为氧化铁，分布不均匀，局部聚集成团块。岩石为颗粒支撑，呈孔隙式胶结。
                </p>
              </div>
            </div>
            <div>2.粉砂岩、泥质岩</div>
            <div>
              <p>
                此类岩石的主要类型有细粉砂岩、粗粉砂岩、粘土、泥岩、含粉砂泥岩、砂质页岩、铁质页岩、钙质页岩、黑色页岩、碳质页岩、油页岩、硅质页岩。
              </p>
              <div>(1)鉴定方法与步骤</div>
              <div>
                <p>粉砂岩的观察方法与砂岩基本相同。</p>
                <p>
                  泥质岩因矿物颗位非常细小，肉眼无法鉴定，因而要注意其颜色及各种物理性质的观察。
                </p>
                <p>
                  要注意观察泥页岩的断口和手触摸时的感觉，据此来判断其结构类型以及与粉砂岩相区别。
                </p>
                <p>
                  正确区分层理和页理，利用颜色、条痕以及加酸起泡与否等区别各种不同类型的页岩。
                </p>
              </div>
              <div>(2)描述实例</div>
              <div>
                <div>I.含粉砂泥岩</div>
                <p>
                  浅灰色。含粉砂泥质结构，块状均造。断口不太平滑，手摸之略有粗糙感。在水中不易泡软，加盐酸不起泡。由此推断主要由粘土矿物组成，含少量粉砂。
                </p>
                <div>II.红色页岩</div>
                <p>
                  砖红色。泥质结构，页理构造。由于岩石受到轻微变质，使其页理不甚明显。断口呈贝壳状。岩石主要由铁质及粘土矿物组成。
                </p>
              </div>
              <div></div>
            </div>
            <div>3.火山碎屑岩类</div>
            <div>
              <p>
                火山碎屑岩在我国主要形成于中生代，在辽东、辽西和大兴安岭地区分布较广。此类岩石的主要类型有角砾熔岩、熔结凝灰岩（或熔结角砾岩）、火山角砾岩、晶屑凝灰岩、玻屑凝灰岩、层凝灰岩、凝灰（质）砂岩和凝灰（质）页岩。野外最常见的火山碎屑岩有：火山角砾岩和凝灰岩。
              </p>
              <p>
                <strong>火山角砾岩：</strong>由50％以上粒度在64－2mm
                的火山碎屑物组成，具火山角砾结构，斑杂构造。火山角砾棱角明显，分选差，粒度变化大。火山角砾岩一般多分布在火山通道附近，也可在离火山口较远的地方堆积，分布范围较集块岩广泛一些。
              </p>
              <p>
                <strong>凝灰岩：</strong>由70％以上粒度﹤2 mm
                的火山碎屑物组成，具典型的凝灰结构，块状构造。颜色浅而多变，多孔疏松，有粗糙感，次生变化显著。由于粒度细小，常堆积在距火山口较远的地方。是分布最广的一种火山碎屑岩。
              </p>
              <div>（1）观察方法与步骤</div>
              <div>
                <p>
                  观察手标本时要注意区分沉积角砾和火山角砾。火山角砾多为火山岩岩屑、呈棱角状，颜色常为紫红色、灰绿色等，常具斑状结构。
                </p>
                <p>
                  凝灰岩的外貌很象细砂岩、粉砂岩，区别在于颜色较特殊，常为紫红、灰绿色等，有时颜色分布很不均匀。凝灰岩中晶屑多呈棱角状，破碎及熔蚀现象明显，晶面常有较多的裂纹。
                </p>
                <p>
                  凝灰岩与火山熔岩也很相似，但凝灰岩具火山碎屑结构，表面粗糙、粘舌。
                </p>
              </div>
              <div>(2)描述实例</div>
              <div>
                <div>I.火山角砾岩（山西临县）</div>
                <p>
                  褐红一紫红色。火山角砾结构、块状构造。岩石中火山碎屑占90％以上，其中以粒径在10－2mm
                  的熔岩角砾为主（约占75％），此外含少量长石和石英晶屑和玻屑。火山角砾外形不规则，呈尖棱角状。火山角砾为褐红色细小的凝灰质胶结。岩石次生变化不明显。
                </p>
                <div>II.流纹质晶屑玻屑凝灰岩（河北）</div>
                <p>
                  手标本观察：白至灰白色。凝灰结构，块状构造。主要成分为极细小的火山凝灰，石英及长石晶屑约占7％左右。岩石具粗糙感，有粘舌现象。
                </p>
                <p>
                  薄片观察：主要成分为玻屑，呈楔状，局部已脱玻化变成石英、长石的微晶集合体。在玻屑中星散分布有酸性斜长石及少量透长石和石英的晶屑。长石和石英晶屑边缘有熔蚀现象。
                </p>
              </div>
            </div>
            <div>4.碳酸盐岩</div>
            <div>
              <div>1)石灰岩</div>
              <div>
                <p>
                  此类岩石的主要类型：砾屑（竹叶状）灰岩、亮晶砂屑灰岩、亮晶（或泥晶）鲡粒灰岩、泥品生物屑灰岩、亮晶生物屑灰岩、泥晶灰岩、结晶灰岩、礁灰岩。
                </p>
                <div>I．方法与步骤</div>
                <p>
                  （1）利用显微放像设备或显微投影仪，认识和掌握颗粒的各种类型以及泥晶和亮晶的特征及区别。
                </p>
                <p>
                  （2）用水着湿岩石标本的新鲜面，用放大镜观察各种结构组分并进行描述。
                </p>
                <div>II．描述实例</div>
                <p>（1）砾屑灰岩（竹叶状灰岩）</p>
                <p>颜色：灰绿色略带灰红色、颜色分布不均匀。</p>
                <p>矿物成分：几乎全由方解石组成，含微量的铁质。</p>
                <p>
                  结构组分：颗粒：主要为砾屑，圆度好，断面呈长椭圆形，似竹叶状，大小不一，表面被氧化铁包围。砾石成分为泥晶灰岩。还有少量砂屑，其成分也是泥晶灰岩，充填于砾屑之间。填隙物：主要为泥晶基质，均已不同程度地重结晶。
                </p>
                <p>结构：砾屑结构；颗粒支撑，为孔隙式胶结。</p>
                <p>岩石名称：泥晶砾屑灰岩。</p>
                <p>（2）鲕粒灰岩</p>
                <p>颜色：暗紫红色。</p>
                <p>矿物成分：几乎全由方解石组成。</p>
                <p>
                  结构组分：颗粒：主要为鲕粒，一般呈球形，少数椭圆形，大小为1—2mm，
                  有同心层圈），含有铁质，因而成暗红色。鲕粒约占岩石60％。还有＜5%的生物碎屑。填隙物：主要为灰白色，但较浑浊的泥晶方解石，与颗粒界限不清晰，约占岩石的20％－25％；有少量灰白色、较干净明亮的方解石，约占岩石10%。
                </p>
                <p>结构：鲕粒结构；基质支撑，为基底式胶结，颗粒互相不接触。</p>
                <p>构造：块状构造。</p>
                <p>岩石名称：亮晶一泥晶缅拉灰岩</p>
              </div>
              <div>2)白云岩、泥灰岩、硅质灰岩及硅质岩</div>
              <div>
                <p>
                  此类岩石的主要类型：碎屑白云岩、细晶白云岩、中一粗晶白云岩、泥晶白云岩、白云质灰岩、泥灰岩、硅质灰岩、硅藻土、燧石岩、碧玉岩。
                </p>
                <div>I.鉴定方法和步骤</div>
                <p>同石灰岩</p>
                <div>II.描述实例</div>
                <p>（1）泥晶白云岩</p>
                <p>
                  暗灰色。隐晶结构，手标本呈块状构造。岩石致密，断口呈贝壳状，加盐酸微弱起泡。岩石由泥晶白云岩组成。
                </p>
                <p>（2）硅质条带石灰岩</p>
                <p>
                  灰色。隐晶一粉晶结构，条带状构造。岩石由浅灰的粉晶石灰岩（约占岩石70％）和暗灰色的硅质条带（约占岩石30％）组成。石灰岩由粉晶方解石组成，加盐酸剧烈起泡，断口略粗糙不平。硅质条带由燧石组成，致密、硬度大于小刀。
                </p>
              </div>
            </div>
          </el-collapse-item>
          <el-collapse-item title="03变质岩" name="6">
            <p>
              变质岩的观察与岩浆岩相似，也是从颜色、结构、构造、矿物成分、次生变化、矿化蚀变特征等方面进行观察和描述。
            </p>
            <div>1．变质岩结构的观察内容</div>
            <div>
              变余砂状结构（变质砂岩） 变余辉绿结构（变质辉绿岩）
              粒状变晶结构（大理岩或石英岩） 角岩结构（长英角岩）
              纤维变晶结构（阳起石片岩） 鳞片变晶结构（绿泥片岩）
              斑状变晶结构（石榴白云母片岩）
            </div>
            <div>2．变质岩构造的观察内容</div>
            <div>
              板状构造（板岩） 千枚构造（千枚岩） 片理构造（各种片岩）
              片麻构造（片麻岩） 块状构造（大理岩）
            </div>
          </el-collapse-item>
        </el-collapse>
      </div>
    </el-tab-pane>
  </el-tabs>
</template>
<style scoped>
.demonstration {
  color: var(--el-text-color-secondary);
}

.demonstration-center {
  display: block;
  text-align: center;
  font-size: 18px;
}

.el-carousel {
  width: 80% !important;
  margin: 0 auto;
}

.el-carousel__item h3 {
  color: #475669;
  opacity: 0.75;
  line-height: 200px;
  margin: 0;
  text-align: center;
}

.el-carousel__item:nth-child(2n) {
  background-color: #99a9bf;
}

.el-carousel__item:nth-child(2n + 1) {
  background-color: #d3dce6;
}
</style>
