<script lang="ts" setup>
import { ref } from "vue";

const activeNames = ref(["1"]);
const activeNames2 = ref(["6"]);
</script>

<template>
  <div style="text-align: center; width: 100%">
    <img
      src="@/assets/RoadmapIntro/location.jpg"
      style="width: 70%; margin: 0 auto"
    />
    <p style="text-align: center !important">徐州连云港地区地理位置图</p>
  </div>
  <p>
    徐州和连云港都位于欧亚大陆桥的东端，江苏省的北部。中国东部著名的郯庐大断裂就从位于这两个城市连线中部的新沂马陵山通过。
  </p>
  <el-tabs type="border-card" class="demo-tabs">
    <el-tab-pane>
      <template #label>
        <span class="custom-tabs-label">
          <span>徐州区域概况</span>
        </span>
      </template>
      <div class="demo-collapse">
        <el-collapse v-model="activeNames" accordion>
          <el-collapse-item title="地理位置" name="1">
            <p>
              徐州位于江苏省的西北部，地处苏、鲁、豫、皖四省交界。距南京、济南、郑州、合肥皆为300余千米。地理坐标为东经116°22′～118°40′，北纬33°43′～34°58′。东西长约210km，南北宽约140km，总面积11258km²。既是亚欧大陆桥上的第一个区域性中心城市，又是我国长江三角洲和环渤海两大经济区的结合部。
            </p>
            <p>
              徐州水、陆、空交通发达。京沪、陇海两大铁路干线在徐州交会，是济南、南京、郑州和连云港之间唯一的重镇和连接地。此外，徐沛、徐淮两条铁路将人屯和淮北矿区连接起来。京杭大运河从徐州市郊通过，除冬季冰期外，均可通行中、小型船只，是我国华东地区“北煤南运”和“南粮北调”的重要水道。徐州观音机场辟有至北京、上海、广州、深圳、海口、重庆、成都、沈阳、太原等地的航线，使徐州的交通更加方便。
            </p>
          </el-collapse-item>
          <el-collapse-item title="地质地貌" name="2">
            <p>
              徐州及附近地区的地层为华北型，属华北地层区鲁西北地层分区徐州—宿县小区。区内基岩出露面积较小，多为第四系覆盖，古老的结品基底未见揭示，盖层发育良好。上元古界青白口系和震旦系均属于一套滨、浅海碎屑岩—碳酸盐岩沉积组合，是华北地台东南缘独特的沉积类型。主要出露于东部种羊场、赵圩、魏集地区以及各复式背斜轴部。下古生界寒武系和奥陶系地层广泛出露，并构成复式背斜翼部，组成徐州地区的山系主体，多呈北东一北北东方向，并向北西方向凸出呈弧形展布上古生界石炭系和二叠系为含煤岩系，组成复式向斜核部，除零星露头外，均隐伏于第四系之下。中生代火山岩、火山碎眉岩主要分布于潘塘断陷槽地内，被第四系掩盖。古近系仅见于九里山煤田夹河井田的钻孔内。第四系在全区广泛分布。
            </p>
            <p>
              徐州位于华北平原的东南部，域内除中部和东部存在少数丘岗外，大部分皆为平原。丘陵海拔一般在100～200m左右，丘陵山地面积约占全市的9.4%。丘陵山地分为两大群，一群分布于市域中部，山体高低不一，其中贾汪区中部的大洞山为全市最高峰，海拔为361m；另一群分布于市域东部，最高点为新沂市北部的马陵山，海拔为122.9m。平原总地势由西北向东南降低，平均坡度为1/7000～1/8000，平原约占土地总面积的90%，海拔一般在30～50m之间。
            </p>
          </el-collapse-item>
          <el-collapse-item title="水系" name="3">
            <p>
              地处古淮河的支流沂、沐、泗诸水的下游，以黄河故道为分水岭，形成北部的沂、沐、泗水系和南部的滩、安河水系。境内河流纵横交错湖沼、水库星罗棋布，废黄河斜穿东西，京杭大运河横贯南北，东有沂、沐诸水及骆马湖，西有夏兴、大沙河及微山湖。拥有大型水库两座，中型水库5座，小型水库84座，总库容3.31亿立方米。初步形成具有防洪、灌溉、航运、水产等多功能的河、湖、渠、库相连的水网系统。
            </p>
          </el-collapse-item>
          <el-collapse-item title="气象气候" name="4">
            <p>
              徐州属暖温带季风气候区，东部属暖温带湿润季风气候，西部为暖温带半湿润气候，受东南季风影响较大。年日照时数为2284～2495小时，日照率为52%～57%，年均气温14℃，年均无霜期为200～220天，年平均降水量为800～930mm。雨季降水量占全年的56%。气候资源较为优越，有利于农作物生长。主要气象灾害有旱、涝、风、霜、冻、冰雹等。气候特点为四季分明，光照充足，雨量适中，雨热同期。四季之中春、秋季短，冬、夏季长，春季天气多变，夏季高温多雨，秋季天高气爽，冬季寒潮频袭。
            </p>
          </el-collapse-item>
          <el-collapse-item title="人文地理" name="5">
            <p>
              徐州是我国著名的历史文化名城之一。远在公元前573年的春秋时期，作为宋邑的彭城就耸立在华夏大地上，至今已有2570多年的历史。曾沿用彭城、徐州、北徐州、武安州等名称。徐州两汉文化资源丰富，除龟山汉墓、狮子山楚王陵、汉兵马俑、项羽戏马台、九里山古战场等两汉文物古迹闻名之外，另有云龙山、淮海战役烈士纪念塔等旅游文化景点。
            </p>
          </el-collapse-item>
        </el-collapse>
      </div>
    </el-tab-pane>
    <el-tab-pane>
      <template #label>
        <span class="custom-tabs-label">
          <span>连云港区域概况</span>
        </span>
      </template>
      <div class="demo-collapse">
        <el-collapse v-model="activeNames2" accordion>
          <el-collapse-item title="地理位置" name="6">
            <p>
              连云港位于江苏省东北部，东临黄海，西接中原，南连江淮，北依齐鲁。地理坐标为东经118°24′～119°48′，北纬34°12′～35°07′之间。连云港地处沿海和大陆、南北过渡的结合部，是首批对外开放的沿海城市之一、新亚欧大陆桥的东方桥头堡。
            </p>
            <p>
              连云港市因港得名，港口坐南朝北，背依云台山，面朝黄海，前有东西连岛作为天然屏障，故取连岛云台山两处首字，称连云港。连云港是著名的终年不冻天然良港，五万吨级海轮通行无阻，现有15个泊位，其中万吨级以上泊位11个。港口与67个国家和地区的170多个港口有航运往来。随着亚欧大陆桥的开通，作为东桥头堡的连云港将成为多功能综合性的国际贸易大港。海运、铁路、航空、内河和公路运输四通八达，已形成海、陆、空立体交叉网络。
            </p>
          </el-collapse-item>
          <el-collapse-item title="地质地貌" name="7">
            <p>
              江苏省海岸带大致以淮阴—响水口断裂为界，分属华北地台和扬子淮地台两大构造单元。连云港区属华北地台，地层以前震且系分布广泛，以各种变质岩为主，组成古老的基底，根据岩石的变质程度不同，自下而上可分为：下元古界胶东群边组、坪上组、上元古界锦屏组和云台山组。地层的韵律性明显，岩层受中—深区域变质作用，从片岩、片麻岩至混合岩均有，上元古界地层与胶东群关系不明。
            </p>
            <p>
              白垩系上统王氏组仅在赣榆县的几个地点及连云港市浦南地段有零星分布，均被第四系覆盖，与下伏前震旦系地层为不整合接触。古近系古、始新统阜宁组仅在灌云县的一个钻孔中有所揭露。第四系在河谷及山前地区有冲积、海积或洪积物堆积，最厚仅50m。岩浆岩仅分布在赣榆县北部的丘陵地区，岩性主要为燕山期花岗闪长岩及花岗岩，在乘车去连云港的路边偶有出露。
            </p>
            <p>
              连云港地貌基本分布为中部平原区，西部岗岭区和东部沿海区三大部分。东部沿海平原海拔3～5m,
              主要为山前倾斜平原、洪水冲积平原及滨海平原三类，总面积 5409
              平方千米，约占全市土地面积的70%。西部东海县的丘陵海拔为100～200m。沿海岸线主要是700平方千米盐田及480平方千米滩涂。沿岛礁共21
              个，其中岛屿9个，面积为6.06平方千米。连岛为江苏第一大岛，面积达5.4平方千米。山脉主要属于沂蒙山的余脉，绵亘近300km。有大小山峰214座，其中云台山主峰玉女峰海拔625.3m，为江苏省最高峰。
            </p>
          </el-collapse-item>
          <el-collapse-item title="水系" name="8">
            <p>
              水系基本属于淮河流域沂沐泗水系。沂沐地区的主要排洪河道新沂河、新沭河等均从市内入海，故有“洪水走廊”之称。境内还有玉带河等大小干支河道
              40余条，有17条为直接入海河流，有盐河等河直接与运河及长江相通。全市共有水库168座，其中石梁河水库为江苏省最大水库，可蓄水4亿立方米。连云港市海岸类型齐全，标准海岸线162km，其中基岩海岸为江苏独有。
            </p>
          </el-collapse-item>
          <el-collapse-item title="气象气候" name="9">
            <p>
              连云港属暖温带湿润性季风海洋性气候，兼有暖温带和北亚热带气候特征，四季分明，冬无严寒，夏无酷暑。常年平均气温13.2～14.1℃，1月平均气温为-0.
              4℃，
              7月平均气温27℃。历年平均降水910～980mm之间。年均日照达2400～2600小时，太阳辐射总量为每平方厘米117.6～125.5千卡。一年四季主导风向为东南风。全年灾害天气主要有寒潮、高温、雷雨、大风、冰雹等。连云港地区沿海属正规半日潮，平均潮差3.10米左右。
            </p>
          </el-collapse-item>
          <el-collapse-item title="人文概况" name="10">
            <p>
              连云港市地处黄河下游，背依云台山，面临黄海，是曾以“东海名郡”著称的古代的海洲。远在十万年前，人类就活动在这块土地上，五千年前少吴民族的先民，辛勤开发了这里的土地。原始农业的经营出现了相当的规模，在将军、白鸽洞、大村、朝阳等处遍布着丰富的新石器时代遗址。为历代黄海之演的政治、文化、军事重镇，1948年11月连云港获得解放。此处曾设为新海连特区，后改为新海连市，属山东省管辖。1961年改名为连云港市（1953年后属江苏省），1962年6月改为省辖市，1983年实行市管县的新体制；现下辖新浦、海州、云台、连云小区和东海、赣榆、灌云三县。全市总面积为6327km²，总人口320多万。
            </p>
            <p>
              连云港地区物产丰富，有对虾、条斑紫菜、海带、彤蟹（梭子蟹）、加吉鱼以及黄鱼、乌贼、海蛎等，旅游者每日清晨可在集市上卖到当天的海鲜。山区有云雾茶香高味醇，芬芳持久；葛藤粉可治疗多种疾病；山螃蟹为接骨食品；水蜜桃在花果山盛产，其中以冬青桃是最为有名。工艺品如贝雕画、水晶雕、羽毛面非常有名。另外东西连岛是省内著名的水貂产地。沿海地区有许多盐场，制碱、盐化工工业较为发达。
            </p>
          </el-collapse-item>
        </el-collapse>
      </div>
    </el-tab-pane>
  </el-tabs>
</template>

<style>
p {
  text-indent: 2em; /* em是相对单位，2em即现在一个字大小的两倍 */
  text-align: justify !important;
}
.demo-tabs > .el-tabs__content {
  padding: 32px;
  color: #6b778c;
  font-size: 32px;
  font-weight: 600;
}
.demo-tabs .custom-tabs-label .el-icon {
  vertical-align: middle;
}
.demo-tabs .custom-tabs-label span {
  vertical-align: middle;
  margin-left: 4px;
}
</style>
